tests/load_tests/stress_test_invcidents_v1_results/statistics.json
{
  "Update Incident Status " : {
    "transaction" : "Update Incident Status ",
    "sampleCount" : 20000,
    "errorCount" : 4521,
    "errorPct" : 22.605,
    "meanResTime" : 183.29744999999983,
    "medianResTime" : 17.5,
    "minResTime" : 2.0,
    "maxResTime" : 1849.0,
    "pct1ResTime" : 768.0,
    "pct2ResTime" : 1014.0,
    "pct3ResTime" : 1443.0,
    "throughput" : 265.7983919197289,
    "receivedKBytesPerSec" : 267.4044994684032,
    "sentKBytesPerSec" : 59.876344046946635
  },
  "Close the  Incident " : {
    "transaction" : "Close the  Incident ",
    "sampleCount" : 20000,
    "errorCount" : 4521,
    "errorPct" : 22.605,
    "meanResTime" : 147.76055000000036,
    "medianResTime" : 15.0,
    "minResTime" : 2.0,
    "maxResTime" : 1841.0,
    "pct1ResTime" : 646.0,
    "pct2ResTime" : 919.9500000000007,
    "pct3ResTime" : 1380.0,
    "throughput" : 262.86735713159135,
    "receivedKBytesPerSec" : 263.85064533936173,
    "sentKBytesPerSec" : 58.6199212178316
  },
  "Create Incident" : {
    "transaction" : "Create Incident",
    "sampleCount" : 20000,
    "errorCount" : 4521,
    "errorPct" : 22.605,
    "meanResTime" : 191.39440000000002,
    "medianResTime" : 24.0,
    "minResTime" : 2.0,
    "maxResTime" : 2025.0,
    "pct1ResTime" : 758.0,
    "pct2ResTime" : 1008.0,
    "pct3ResTime" : 1440.0,
    "throughput" : 268.976276292431,
    "receivedKBytesPerSec" : 270.863142243901,
    "sentKBytesPerSec" : 88.42637110656841
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 80000,
    "errorCount" : 18084,
    "errorPct" : 22.605,
    "meanResTime" : 177.45151249999907,
    "medianResTime" : 161.0,
    "minResTime" : 2.0,
    "maxResTime" : 2025.0,
    "pct1ResTime" : 1255.0,
    "pct2ResTime" : 1406.9500000000007,
    "pct3ResTime" : 1484.0,
    "throughput" : 984.6275031077305,
    "receivedKBytesPerSec" : 988.3584144112543,
    "sentKBytesPerSec" : 235.36539680488377
  },
  "Get incident" : {
    "transaction" : "Get incident",
    "sampleCount" : 20000,
    "errorCount" : 4521,
    "errorPct" : 22.605,
    "meanResTime" : 187.35365000000004,
    "medianResTime" : 13.0,
    "minResTime" : 2.0,
    "maxResTime" : 1796.0,
    "pct1ResTime" : 768.0,
    "pct2ResTime" : 1044.9500000000007,
    "pct3ResTime" : 1446.0,
    "throughput" : 267.4869600106995,
    "receivedKBytesPerSec" : 267.0478660600843,
    "sentKBytesPerSec" : 47.91678856827605
  }
}