tests/load_tests/stress_test_invcidents_v1_scaled3_results/statistics.json
{
  "Update Incident Status " : {
    "transaction" : "Update Incident Status ",
    "sampleCount" : 20000,
    "errorCount" : 4521,
    "errorPct" : 22.605,
    "meanResTime" : 169.22625000000005,
    "medianResTime" : 18.0,
    "minResTime" : 2.0,
    "maxResTime" : 2209.0,
    "pct1ResTime" : 692.0,
    "pct2ResTime" : 950.9500000000007,
    "pct3ResTime" : 1325.0,
    "throughput" : 273.62401324340226,
    "receivedKBytesPerSec" : 275.35918763168155,
    "sentKBytesPerSec" : 61.62875869611317
  },
  "Close the  Incident " : {
    "transaction" : "Close the  Incident ",
    "sampleCount" : 20000,
    "errorCount" : 4521,
    "errorPct" : 22.605,
    "meanResTime" : 131.8508499999999,
    "medianResTime" : 15.0,
    "minResTime" : 2.0,
    "maxResTime" : 2518.0,
    "pct1ResTime" : 517.0,
    "pct2ResTime" : 815.9500000000007,
    "pct3ResTime" : 1275.9800000000032,
    "throughput" : 268.15402767349565,
    "receivedKBytesPerSec" : 269.1348062670948,
    "sentKBytesPerSec" : 59.80223692832913
  },
  "Create Incident" : {
    "transaction" : "Create Incident",
    "sampleCount" : 20000,
    "errorCount" : 4521,
    "errorPct" : 22.605,
    "meanResTime" : 191.44314999999918,
    "medianResTime" : 25.0,
    "minResTime" : 2.0,
    "maxResTime" : 2523.0,
    "pct1ResTime" : 729.0,
    "pct2ResTime" : 1041.0,
    "pct3ResTime" : 1348.9900000000016,
    "throughput" : 275.58078650756465,
    "receivedKBytesPerSec" : 277.50403898090224,
    "sentKBytesPerSec" : 90.60029192186596
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 80000,
    "errorCount" : 18084,
    "errorPct" : 22.605,
    "meanResTime" : 168.73980000000032,
    "medianResTime" : 90.0,
    "minResTime" : 2.0,
    "maxResTime" : 2523.0,
    "pct1ResTime" : 1045.9000000000015,
    "pct2ResTime" : 1259.9500000000007,
    "pct3ResTime" : 1338.0,
    "throughput" : 1011.7873223048515,
    "receivedKBytesPerSec" : 1015.6924483711805,
    "sentKBytesPerSec" : 241.85117211213765
  },
  "Get incident" : {
    "transaction" : "Get incident",
    "sampleCount" : 20000,
    "errorCount" : 4521,
    "errorPct" : 22.605,
    "meanResTime" : 182.43895000000015,
    "medianResTime" : 14.0,
    "minResTime" : 2.0,
    "maxResTime" : 2344.0,
    "pct1ResTime" : 745.0,
    "pct2ResTime" : 1088.9500000000007,
    "pct3ResTime" : 1337.0,
    "throughput" : 273.1941864277128,
    "receivedKBytesPerSec" : 272.7736434628046,
    "sentKBytesPerSec" : 48.93648224493908
  }
}