tests/load_tests/stress_test_invcidents_v1_scaled6_results/statistics.json
{
  "Update Incident Status " : {
    "transaction" : "Update Incident Status ",
    "sampleCount" : 20000,
    "errorCount" : 4526,
    "errorPct" : 22.63,
    "meanResTime" : 128.6437,
    "medianResTime" : 14.0,
    "minResTime" : 2.0,
    "maxResTime" : 1657.0,
    "pct1ResTime" : 553.0,
    "pct2ResTime" : 814.0,
    "pct3ResTime" : 1135.9900000000016,
    "throughput" : 273.28751212713337,
    "receivedKBytesPerSec" : 275.1068757002992,
    "sentKBytesPerSec" : 61.536568110934226
  },
  "Close the  Incident " : {
    "transaction" : "Close the  Incident ",
    "sampleCount" : 20000,
    "errorCount" : 4526,
    "errorPct" : 22.63,
    "meanResTime" : 103.10745000000016,
    "medianResTime" : 14.0,
    "minResTime" : 2.0,
    "maxResTime" : 1570.0,
    "pct1ResTime" : 368.90000000000146,
    "pct2ResTime" : 729.0,
    "pct3ResTime" : 1107.9900000000016,
    "throughput" : 267.2581981452281,
    "receivedKBytesPerSec" : 268.3488021195245,
    "sentKBytesPerSec" : 59.58320562010583
  },
  "Create Incident" : {
    "transaction" : "Create Incident",
    "sampleCount" : 20000,
    "errorCount" : 4526,
    "errorPct" : 22.63,
    "meanResTime" : 115.64815000000067,
    "medianResTime" : 18.0,
    "minResTime" : 3.0,
    "maxResTime" : 1570.0,
    "pct1ResTime" : 419.90000000000146,
    "pct2ResTime" : 734.0,
    "pct3ResTime" : 1121.0,
    "throughput" : 278.7495296101688,
    "receivedKBytesPerSec" : 280.82388615607886,
    "sentKBytesPerSec" : 91.61214899336576
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 80000,
    "errorCount" : 18104,
    "errorPct" : 22.63,
    "meanResTime" : 116.72281250000053,
    "medianResTime" : 89.0,
    "minResTime" : 2.0,
    "maxResTime" : 1942.0,
    "pct1ResTime" : 901.0,
    "pct2ResTime" : 1053.0,
    "pct3ResTime" : 1402.9900000000016,
    "throughput" : 1009.8842420187586,
    "receivedKBytesPerSec" : 1014.1701355138417,
    "sentKBytesPerSec" : 241.32372352209754
  },
  "Get incident" : {
    "transaction" : "Get incident",
    "sampleCount" : 20000,
    "errorCount" : 4526,
    "errorPct" : 22.63,
    "meanResTime" : 119.49195000000023,
    "medianResTime" : 9.0,
    "minResTime" : 2.0,
    "maxResTime" : 1942.0,
    "pct1ResTime" : 511.0,
    "pct2ResTime" : 791.0,
    "pct3ResTime" : 1116.0,
    "throughput" : 274.6083398552814,
    "receivedKBytesPerSec" : 274.2777371586275,
    "sentKBytesPerSec" : 49.176601374243106
  }
}